[{ "id": 0,"sanskrit_text": "सर्ववेदान्तसिद्धान्तगोचरं तमगोचरम् । \nगोविन्दं परमानन्दं सद्गुरुं प्रणतोऽस्म्यहम् ॥ १ ॥", "english_text": "The first text ENG entry.", "meaning": "The first text MEANING entry.", "text": "The first text entry." },{ "id": 1, "sanskrit_text": "सर्ववेदान्तसिद्धान्तगोचरं तमगोचरम् । \nगोविन्दं परमानन्दं सद्गुरुं प्रणतोऽस्म्यहम् ॥ १ ॥", "english_text": "sarvavedāntasiddhāntagocaraṃ tamagocaram | govindaṃ paramānandaṃ sadguruṃ praṇato’smyaham || 1 ||", "meaning": "1. I bow to Govinda, whose nature is Bliss Supreme, who is the Satguru, who can be known only from the import of all Vedanta, and who is beyond the reach of speech and mind." },
    { "id": 2, "sanskrit_text": "जन्तूनां नरजन्म दुर्लभमतः पुंस्त्वं ततो विप्रता \nतस्माद्वैदिकधर्ममार्गपरता विद्वत्त्वमस्मात्परम् । \nआत्मानात्मविवेचनं स्वनुभवो ब्रह्मात्मना संस्थितिः  \nमुक्तिर्नो शतजन्मकोटिसुकृतैः पुण्यैर्विना लभ्यते ॥ २ ॥", "english_text": "jantūnāṃ narajanma durlabhamataḥ puṃstvaṃ tato vipratā \ntasmādvaidikadharmamārgaparatā vidvattvamasmātparam | \nātmānātmavivecanaṃ svanubhavo brahmātmanā saṃsthitiḥ \nmuktirno śatajanmakoṭisukṛtaiḥ puṇyairvinā labhyate || 2 ||", "meaning": "2. For all beings a human birth is difficult to obtain, more so is a male body; rarer than that is Brahmin-hood; rarer still is the attachment to the path of Vedic religion; higher than this is erudition in the scriptures; discrimination between the Self and not-Self, Realisation, and continuing in a state of identity with Brahman – these come next in order. (This kind of) Mukti (Liberation) is not to be attained except through the well-earned merits of a hundred crore of births." },
    { "id": 3, "sanskrit_text": "दुर्लभं त्रयमेवैतद्देवानुग्रहहेतुकम् । \nमनुष्यत्वं मुमुक्षुत्वं महापुरुषसंश्रयः ॥ ३ ॥", "english_text": "durlabhaṃ trayamevaitaddevānugrahahetukam | \nmanuṣyatvaṃ mumukṣutvaṃ mahāpuruṣasaṃśrayaḥ || 3 ||", "meaning": "3. There are three things which are rare indeed and are due to the grace of God –namely, a human birth, the longing for Liberation, and the protecting care of a perfected sage." },
    { "id": 4, "sanskrit_text": "लब्ध्वा कथंचिन्नरजन्म दुर्लभं \nतत्रापि पुंस्त्वं श्रुतिपारदर्शनम् । \nयस्त्वात्ममुक्तौ न यतेत मूढधीः \nस ह्यात्महा स्वं विनिहन्त्यसद्ग्रहात् ॥ ४ ॥", "english_text": "labdhvā kathaṃcinnarajanma durlabhaṃ \ntatrāpi puṃstvaṃ śrutipāradarśanam | \nyastvātmamuktau na yateta mūḍhadhīḥ \nsa hyātmahā svaṃ vinihantyasadgrahāt || 4 ||", "meaning": "4. The man who, having by some means obtained a human birth, with a male body and mastery of the Vedas to boot, is foolish enough not to exert himself for self-liberation, verily commits suicide, for he kills himself by clinging to things unreal." },
    { "id": 5, "sanskrit_text": "इतः को न्वस्ति मूढात्मा यस्तु स्वार्थे प्रमाद्यति । \nदुर्लभं मानुषं देहं प्राप्य तत्रापि पौरुषम् ॥ ५ ॥", "english_text": "itaḥ ko nvasti mūḍhātmā yastu svārthe pramādyati | \ndurlabhaṃ mānuṣaṃ dehaṃ prāpya tatrāpi pauruṣam || 5 ||", "meaning": "5. What greater fool is there than the man who having obtained a rare human body, and a masculine body too, neglects to achieve the real end of this life? (The real end .—viz. Liberation from the cycle of birth and death.)" },
    { "id": 6, "sanskrit_text": "वदन्तु शास्त्राणि यजन्तु देवान् \nकुर्वन्तु कर्माणि भजन्तु देवताः । \nआत्मैक्यबोधेन विनापि मुक्तिः \nन सिध्यति ब्रह्मशतान्तरेऽपि ॥ ६ ॥", "english_text": "vadantu śāstrāṇi yajantu devān\nkurvantu karmāṇi bhajantu devatāḥ | \nātmaikyabodhena vināpi muktiḥ \nna sidhyati brahmaśatāntare’pi || 6 ||", "meaning": "6. Let people quote the Scriptures and sacrifice to the gods, let them perform rituals and worship the deities, but there is no Liberation without the realisation of one’s identity with the Ātman, no, not even in the lifetime of a hundred Brahmas put together.", "notes":"Notes: Lifetime .—i. e., an indefinite length of time. One day of Brahmâ (the Creator) is equivalent to 432 million years of human computation, which is supposed to be the duration of the world therefore without knowing of self or soul we don't get liberation " }, 
    { "id": 7, "sanskrit_text": "अमृतत्वस्य नाशास्ति वित्तेनेत्येव हि श्रुतिः । \nब्रवीति कर्मणो मुक्तेरहेतुत्वं स्फुटं यतः ॥ ७ ॥", "english_text": "amṛtatvasya nāśāsti vittenetyeva hi śrutiḥ | \nbravīti karmaṇo mukterahetutvaṃ sphuṭaṃ yataḥ || 7 ||", "meaning": "7. There is no hope of immortality by means of riches – such indeed is the declaration of the Vedas. Hence it is clear that works cannot be the cause of Liberation.", "notes":"Notes: The reference is to Yâjnavalkya’s words to his wife Maitreyi, Brihadáranyaka II. iv. 2. Cf. the Vedic dictum, “na karmaṇā na prajayā dhanena tyāgenaike amṛtatvamānaśuḥ”:—‘Neither by rituals, nor progeny, nor by riches, but by-renunciation alone some attained immortality aka libration." },
    { "id": 8, "sanskrit_text": "अतो विमुक्त्यै प्रयतेत्विद्वान् \nसंन्यस्तबाह्यार्थसुखस्पृहः सन् । \nसन्तं महान्तं समुपेत्य देशिकं \nतेनोपदिष्टार्थसमाहितात्मा ॥ ८ ॥", "english_text": "ato vimuktyai prayatetvidvān \nsaṃnyastabāhyārthasukhaspṛhaḥ san | \nsantaṃ mahāntaṃ samupetya deśikaṃ \ntenopadiṣṭārthasamāhitātmā || 8 ||", "meaning": "8. Therefore the man of learning should strive his best for Liberation, having renounced his desire for pleasures from external objects, duly approaching a good and generous preceptor, and fixing his mind on the truth inculcated by him.", "notes": "Duly—i. e. according to the prescribed mode. (Vide Mundaka 1. ii. 12). The characteristics of a qualified Guru (Vedvyas, Adi Shankaracharya, Ramakrishna Paramhans, Premanand Maharaj) are given later on in sloka 33."},
    { "id": 9, "sanskrit_text": "उद्धरेदात्मनात्मानं मग्नं संसारवारिधौ । \nयोगारूढत्वमासाद्य सम्यग्दर्शननिष्ठया ॥ ९ ॥", "english_text": "uddharedātmanātmānaṃ magnaṃ saṃsāravāridhau | \nyogārūḍhatvamāsādya samyagdarśananiṣṭhayā || 9 ||", "meaning": "9. Having attained the Yogārūḍha state, one should recover oneself, immersed in the sea of birth and death by means of devotion to right discrimination.", "notes":"Yogárudha state—Described in Gita VI. 4.—“When one is attached neither to sense-objects nor to actions, and has given up all desires, then he is said to be Yogárudha or to have ascended the Yoga-path.”" },
    { "id": 10, "sanskrit_text": "संन्यस्य सर्वकर्माणि भवबन्धविमुक्तये । \nयत्यतां पण्डितैर्धीरैरात्माभ्यास उपस्थितैः ॥ १0 ॥", "english_text": "saṃnyasya sarvakarmāṇi bhavabandhavimuktaye | \nyatyatāṃ paṇḍitairdhīrairātmābhyāsa upasthitaiḥ || 10 ||", "meaning": "10. Let the wise and erudite man, having commenced the practice of the realisation of the Ātman give up all works and try to cut loose the bonds of birth and death.", "notes":"All works—only Sakáma-Karma or works performed with a view to gaining more sense-enjoyment are meant, not selfless work, like giving up all works which leads to materialistic pleasures" },
    {  "id": 11, "sanskrit_text":"चित्तस्य शुद्धये कर्म न तु वस्तूपलब्धये । \nवस्तुसिद्धिर्विचारेण न किंचित्कर्मकोटिभिः ॥ ११ ॥", "english_text":"cittasya śuddhaye karma na tu vastūpalabdhaye | \nvastusiddhirvicāreṇa na kiṃcitkarmakoṭibhiḥ || 11 ||", "meaning":"11. Work leads to purification of the mind, not to perception of the Reality. The realisation of Truth is brought about by discrimination and not in the least by ten million of acts.", "notes":"The idea is, that works properly done cleanse the mind of its impurities, when the Truth flashes of itself."},
    { "id": 12, "sanskrit_text":"सम्यग्विचारतः सिद्धा रज्जुतत्त्वावधारणा । \nभ्रान्तोदितमहासर्पभयदुःखविनाशिनी ॥ १२ ॥", "english_text":"samyagvicārataḥ siddhā rajjutattvāvadhāraṇā | \nbhrāntoditamahāsarpabhayaduḥkhavināśinī || 12 ||", "meaning":"12. By adequate reasoning the conviction of the reality about the rope is gained, which puts an end to the great fear and misery caused by the snake worked up in the deluded mind.", "notes":"Reality of the rope—i. e. that it is a rope and not a snake, for which it was mistaken."},
    { "id": 13, "sanskrit_text":"अर्थस्य निश्चयो दृष्टो विचारेण हितोक्तितः । \nन स्नानेन न दानेन प्राणायमशतेन वा ॥ १३ ॥", "english_text":"arthasya niścayo dṛṣṭo vicāreṇa hitoktitaḥ |\nna snānena na dānena prāṇāyamaśatena vā || 13 ||", "meaning":"13. The conviction of the Truth is seen to proceed from reasoning upon the salutary counsel of the wise, and not by bathing in the sacred waters, nor by gifts, nor by hundreds of Prāṇāyāmas (control of the vital force).", "notes":"The wise—men of realisation."},
    { "id": 14, "sanskrit_text":"अधिकारिणमाशास्ते फलसिद्धिर्विशेषतः । \nउपाया देशकालाद्याः सन्त्यस्मिन्सहकारिणः ॥ १४ ॥", "english_text":"adhikāriṇamāśāste phalasiddhirviśeṣataḥ | \nupāyā deśakālādyāḥ santyasminsahakāriṇaḥ || 14 ||", "meaning":"14. Success depends essentially on a qualified aspirant; time, place and other such means are but auxiliaries in this regard.", "notes":"The qualifications will be enumerated in stanzas 16 and 17."},
    { "id": 15, "sanskrit_text":"अतो विचारः कर्तव्यो जिज्ञासोरात्मवस्तुनः । \nसमासाद्य दयासिन्धुं गुरुं ब्रह्मविदुत्तमम् ॥ १५ ॥", "english_text":"ato vicāraḥ kartavyo jijñāsorātmavastunaḥ | \nsamāsādya dayāsindhuṃ guruṃ brahmaviduttamam || 15 ||", "meaning":"15. Hence the seeker after the Reality of the Ātman should take to reasoning, after duly approaching the Guru – who should be the best of the knowers of Brahman, and an ocean of mercy.", "notes":""},
    { "id": 16, "sanskrit_text":"मेधावी पुरुषो विद्वानुहापोहविचक्षणः । \nअधिकार्यात्मविद्यायामुक्तलक्षणलक्षितः ॥ १६ ॥", "english_text":"medhāvī puruṣo vidvānuhāpohavicakṣaṇaḥ | \nadhikāryātmavidyāyāmuktalakṣaṇalakṣitaḥ || 16 ||", "meaning":"16. An intelligent and learned man skilled in arguing in favour of the Scriptures and in refuting counter-arguments against them – one who has got the above characteristics is the fit recipient of the knowledge of the Ātman.", "notes":""},
    { "id": 17, "sanskrit_text":"विवेकिनो विरक्तस्य शमादिगुणशालिनः । \nमुमुक्षोरेव हि ब्रह्मजिज्ञासायोग्यता मता ॥ १७ ॥", "english_text":"vivekino viraktasya śamādiguṇaśālinaḥ | \nmumukṣoreva hi brahmajijñāsāyogyatā matā || 17 ||", "meaning":"17. The man who discriminates between the Real and the unreal, whose mind is turned away from the unreal, who possesses calmness and the allied virtues, and who is longing for Liberation, is alone considered qualified to inquire after Brahman.", "notes":""},
    { "id": 18, "sanskrit_text":"साधनान्यत्र चत्वारि कथितानि मनीषिभिः । \nयेषु सत्स्वेव सन्निष्ठा यदभावे न सिध्यति ॥ १८ ॥", "english_text":"sādhanānyatra catvāri kathitāni manīṣibhiḥ | \nyeṣu satsveva sanniṣṭhā yadabhāve na sidhyati || 18 ||", "meaning":"18. Regarding this, sages have spoken of four means of attainment, which alone being present, the devotion to Brahman succeeds, and in the absence of which, it fails.", "notes":""},
    { "id": 19, "sanskrit_text":"आदौ नित्यानित्यवस्तुविवेकः परिगम्यते । \nइहामुत्रफलभोगविरागस्तदनन्तरम् \nशमादिषट्कसम्पत्तिर्मुमुक्षुत्वमिति स्फुटम् ॥ १९ ॥", "english_text":"ādau nityānityavastuvivekaḥ parigamyate | \nihāmutraphalabhogavirāgastadanantaram \nśamādiṣaṭkasampattirmumukṣutvamiti sphuṭam || 19 ||", "meaning":"19. First is enumerated discrimination between the Real and the unreal; next comes aversion to the enjoyment of fruits (of one’s actions) here and hereafter; (next is) the group of six attributes, viz. calmness and the rest; and (last) is clearly the yearning for Liberation.", "notes":""},
    { "id": 20, "sanskrit_text":"ब्रह्म सत्यं जगन्मिथ्येत्येवंरूपो विनिश्चयः । \nसोऽयं नित्यानित्यवस्तुविवेकः समुदाहृतः ॥ २0 ॥", "english_text":"brahma satyaṃ jaganmithyetyevaṃrūpo viniścayaḥ | \nso’yaṃ nityānityavastuvivekaḥ samudāhṛtaḥ || 20 ||", "meaning":"20. A firm conviction of the mind to the effect that Brahman is real and the universe unreal, is designated as discrimination (Viveka) between the Real and the unreal.", "notes":"Discrimination (Viveka)- god is real and universe is unreal fixing this in mind."},
    { "id": 21, "sanskrit_text":"तद्वैराग्यं जिहासा या दर्शनश्रवणादिभिः । \nदेहादिब्रह्मपर्यन्ते ह्यनित्ये भोगवस्तुनि ॥ २१ ॥", "english_text":"tadvairāgyaṃ jihāsā yā darśanaśravaṇādibhiḥ | \ndehādibrahmaparyante hyanitye bhogavastuni || 21 ||", "meaning":"21. Vairāgya or renunciation is the desire to give up all transitory enjoyments (ranging) from those of an (animate) body to those of Brahmāhood (having already known their defects) from observation, instruction and so forth.", "notes":"From those…… Brahmáhood.—Brahmá is the highest being in the scale of relative existence. The seeker after Freedom has to transcend this scale, undetained by enjoyments implying subject-object relation, and realise his Self as Existence-Knowledge-Bliss Absolute. Having already known etc.—“darśanaśravaṇādibhiḥ”—may also be rendered as, “(the giving up being effected) through all the enjoying organs and faculties.”"},
    { "id": 22, "sanskrit_text":"विरज्य विषयव्राताद्दोषदृष्ट्या मुहुर्मुहुः । \nस्वलक्ष्ये नियतावस्था मनसः शम उच्यते ॥ २२ ॥", "english_text":"virajya viṣayavrātāddoṣadṛṣṭyā muhurmuhuḥ | \nsvalakṣye niyatāvasthā manasaḥ śama ucyate || 22 ||", "meaning":"22. The resting of the mind steadfastly on its Goal (viz. Brahman) after having detached itself from manifold sense-objects by continually observing their defects, is called Śama or calmness.", "notes":""},
    { "id": 23, "sanskrit_text":"विषयेभ्यः परावर्त्य स्थापनं स्वस्वगोलके । \nउभयेषामिन्द्रियाणां स दमः परिकीर्तितः \nबाह्यानालम्बनं वृत्तेरेषोपरतिरुत्तमा ॥ २३ ॥", "english_text":"viṣayebhyaḥ parāvartya sthāpanaṃ svasvagolake |\nubhayeṣāmindriyāṇāṃ sa damaḥ parikīrtitaḥ \nbāhyānālambanaṃ vṛttereṣoparatiruttamā || 23 ||", "meaning":"23. Turning both kinds of sense-organs away from sense-objects and placing them in their respective centres, is called Dama or self-control. The best Uparati or self-withdrawal consists in the mind-function ceasing to act by means of external objects.", "notes":"Both kinds of organs—viz. The organs of knowledge and those of action."},
    { "id": 24, "sanskrit_text":"सहनं सर्वदुःखानामप्रतीकारपूर्वकम् । \nचिन्ताविलापरहितं सा तितिक्षा निगद्यते ॥ २४ ॥", "english_text":"sahanaṃ sarvaduḥkhānāmapratīkārapūrvakam |\ncintāvilāparahitaṃ sā titikṣā nigadyate || 24 ||", "meaning":"24. The bearing of all afflictions without caring to redress them, being free (at the same time) from anxiety or lament on their score, is called Titikṣā or forbearance.", "notes":""},
    { "id": 25, "sanskrit_text":"शास्त्रस्य गुरुवाक्यस्य सत्यबुद्ध्यवधारणम् । \nसा श्रद्धा कथिता सद्भिर्यया वस्तूपलभ्यते ॥ २५ ॥", "english_text":"śāstrasya guruvākyasya satyabuddhyavadhāraṇam | \nsā śraddhā kathitā sadbhiryayā vastūpalabhyate || 25 ||", "meaning":"25. Acceptance by firm judgment as true of what the Scriptures and the Guru instruct, is called by sages Śraddhā or faith, by means of which the Reality is perceived.", "notes":"Acceptance by firin judgment etc. —Not to be confused with what is generally called blind acceptance. The whole mind must attain to that perfect state of assured reliance on the truth of instructions received, without which a whole-hearted, onepointed practice of those instructions is not possible.", "word": "शास्त्रस्य (śāstrasya) शास्त्र (śāstra): Scripture, sacred text, or science. स्य (sya): Genitive case, meaning 'of the scripture'. Translation: Of the scripture." },
    {"id":26, "sanskrit_text": "सर्वदा स्थापनं बुद्धेः शुद्धे ब्रह्मणि सर्वदा । \nतत्समाधानमित्युक्तं न तु चित्तस्य लालनम् ॥ २६ ॥", "english_text": "sarvadā sthāpanaṃ buddheḥ śuddhe brahmaṇi sarvadā | \ntatsamādhānamityuktaṃ na tu cittasya lālanam || 26 ||", "meaning": "26. Not the mere indulgence of thought (in curiosity) but the constant concentration of the intellect (or the affirming faculty) on the ever-pure Brahman is what is called Saraadhdna or self-settledness.", "notes": "[Not the mere indulgence etc.-- That is, not the mere intellectual or philosophical satisfaction in thinking of or studying the Truth. The intellect must be sought to be resolved into the higher activity of concentration on the Truth."},
    {"id":27, "sanskrit_text": "अहंकारादिदेहान्तान् बन्धानज्ञानकल्पितान् । \nस्वस्वरूपावबोधेन मोक्तुमिच्छा मुमुक्षुता ॥ २७ ॥", "english_text": "", "meaning": "The desire to liberate oneself from the bondages—beginning with the ego and ending with the body, which are fabricated by ignorance—through the realization of one’s true nature, is called mumukṣutā (the desire for liberation)", "notes": "Wanting to free yourself from the chains of ego, body, and everything in between—chains created by ignorance—by understanding your true self, that’s what’s called mumukṣutā or the longing for liberation."},
    {"id":28, "sanskrit_text": "मन्दमध्यमरूपापि वैराग्येण शमादिना । \nप्रसादेन गुरोः सेयं प्रवृद्धा सूयते फलम् ॥ २८ ॥", "english_text": "mandamadhyamarūpāpi vairāgyeṇa śamādinā | \nprasādena guroḥ seyaṃ pravṛddhā sūyate phalam || 28 ||", "meaning": "28. Even though torpid or mediocre, this yearning for Freedom, through the grace of the Guru, may bear fruit (being developed) by means of Vairāgya (renunciation), Śama(calmness), and so on.", "notes": "Mandamadhyamarūpāpi: The subject (feminine, possibly śraddhā or buddhi from prior verses) may begin as weak or moderate—imperfect or underdeveloped. Vairāgyeṇa śamādinā: Through practices like detachment (vairāgya) and mental calmness (śama), along with related virtues (e.g., patience, discipline), it gains strength. Prasādena guroḥ: The guru’s grace (prasāda) is a catalyst, providing guidance or blessings to elevate it. Seyaṃ pravṛddhā sūyate phalam: As a result, this quality matures (pravṛddhā) and produces fruit (phalam)—likely liberation (moksha), wisdom, or spiritual fulfillment."},
    {"id":29, "sanskrit_text": "वैराग्यं च मुमुक्षुत्वं तीव्रं यस्य तु विद्यते । \nतस्मिन्नेवार्थवन्तः स्युः फलवन्तः शमादयः ॥ २९ ॥", "english_text": "vairāgyaṃ ca mumukṣutvaṃ tīvraṃ yasya tu vidyate | \ntasminnevārthavantaḥ syuḥ phalavantaḥ śamādayaḥ || 29 ||", "meaning": "For him in whom intense detachment and the desire for liberation are present, in him alone do calmness and similar qualities become meaningful and fruitful.", "notes": "If someone has strong detachment and a deep desire for liberation, only then do qualities like calmness become meaningful and produce results.", "explanation": "Vairāgyaṃ ca mumukṣutvaṃ tīvraṃ yasya tu vidyate: The intensity (tīvra) of these two qualities distinguishes a serious seeker. They must be strong, not lukewarm, to drive real transformation. Tasmin eva arthavantaḥ syuḥ phalavantaḥ śamādayaḥ: Virtues like śama (calmness) and others (part of shad-sampatti, the sixfold discipline in Vedanta) only bear fruit (phalavantaḥ) and have purpose (arthavantaḥ) in someone with these prerequisites. Without detachment and longing for liberation, such qualities remain superficial or ineffective."},
    {"id":30, "sanskrit_text": "एतयोर्मन्दता यत्र विरक्तत्वमुमुक्षयोः । \nमरौ सलीलवत्तत्र शमादेर्भानमात्रता ॥ ३0 ॥", "english_text": "etayormandatā yatra viraktatvamumukṣayoḥ | \nmarau salīlavattatra śamāderbhānamātratā || 30 ||", "meaning": "30. Where (however) this renunciation and yearning for Freedom are torpid, there calmness and the other practices are as mere appearances, like water in a desert.", "notes": "Where detachment and the thirst for freedom falter, it’s a desert—peace and its friends pop up like a game, but they’re just a shadow, not the real thing and Mere appearances etc.—i. e. they are without any stability and may vanish like the mirage any time. For without burning renunciation and desire for Freedom, the other practices may be swept off by a strong impulse of or some strong blind attachment", "explanation": "Etayoḥ mandatā yatra viraktatvamumukṣayoḥ: If vairāgya (detachment) and mumukṣutva (desire for liberation)—two pillars of spiritual progress—are weak or half-hearted, the foundation crumbles. Marau salīlavat: This weak state is likened to a 'desert'(marau), barren and unproductive, where growth is an illusion. Salīlavat (playfully, with ease) suggests these qualities might appear effortlessly, without real effort. Tatra śamādeḥ bhānamātratā: Virtues like śama (calmness) and others (ādayaḥ) may seem present, but they’re superficial (bhānamātratā), lacking depth or transformative power."},
    {"id":31, "sanskrit_text": "मोक्षकारणसामग्र्यां भक्तिरेव गरीयसी । \nस्वस्वरूपानुसन्धानं भक्तिरित्यभिधीयते ॥ ३१ ॥", "english_text": "mokṣakāraṇasāmagryāṃ bhaktireva garīyasī | \nsvasvarūpānusandhānaṃ bhaktirityabhidhīyate || 31 ||", "meaning": "31. Among things conducive to Liberation, devotion (Bhakti) holds the supreme place. The seeking after one’s real nature is designated as devotion.", "notes": "The seeking etc.—This definition is from the Advaita standpoint. Dualists who substitute Isvara, the Supreme Lord, for the Atman or Supreme Self immanent in being, of course define Bhakti otherwise. For example, Narada defines it as “sā kasmaicit paramapremarūpā”—“It is of the nature of extreme love to some Being,” and Sandilya, another authority on the subject, puts it as “sā parānuraktirīśvare”—“It is extreme attachment to Isvara, the Lord.” On reflection it will appear that there is not much difference between the definitions of the two schools.", "explanation": "This verse, elevates bhakti (devotion) in the Advaita Vedanta framework: Mokṣakāraṇasāmagryāṃ bhaktir eva garīyasī: Among all tools or paths to moksha (liberation)—like knowledge (jnana), action (karma), or discipline—bhakti stands supreme (garīyasī). This might surprise some, as Advaita often emphasizes jnana (knowledge), but here bhakti is highlighted. Svasvarūpānusandhānaṃ bhaktir ity abhidhīyate: Bhakti is redefined not as emotional worship or devotion to a deity, but as anusandhāna—a steady, introspective focus on one’s true self (svarūpa), the ātman or Brahman. This aligns Advaitic non-dualism with devotion, framing it as self-inquiry."},
    {"id":32, "sanskrit_text": "स्वात्मतत्त्वानुसन्धानं भक्तिरित्यपरे जगुः । \nउक्तसाधनसंपन्नस्तत्त्वजिज्ञासुरात्मनः \nउपसीदेद्गुरुं प्राज्ञ्यं यस्माद्बन्धविमोक्षणम् ॥ ३२ ॥", "english_text": "svātmatattvānusandhānaṃ bhaktirityapare jaguḥ | \nuktasādhanasaṃpannastattvajijñāsurātmanaḥ \nupasīdedguruṃ prājñyaṃ yasmādbandhavimokṣaṇam || 32 ||", "meaning": "32. Others maintain that the inquiry into the truth of one’s own self is devotion. The inquirer about the truth of the Ātman who is possessed of the above-mentioned means of attainment should approach a wise preceptor, who confers emancipation from bondage.", "notes": "Truth of one’s own self .—This is simply putting the statement of the previous Sloka in another way, for we are the Atman in reality, though ignorance has veiled the truth from us. Above-mentioned—i. e. in Slokas 19 and 31", "explanation": "(verses 31b and 32 or a similar numbering): First Part: Builds on the previous verse (31), where bhakti was defined as contemplating one’s true nature. Here, 'others' (apare) reinforce this by calling it svātmatattvānusandhānaṃ—focusing on the essence (tattva) of the self. It broadens the definition of devotion to include intellectual inquiry, a hallmark of Advaita’s synthesis of bhakti and jnana. \nSecond Part: Offers practical advice. A seeker equipped with the qualities mentioned earlier (e.g., vairāgya, mumukṣutva, śama) and driven to know the self (tattvajijñāsu) must seek a guru (prājña). The guru is the key to liberation (bandhavimokṣaṇam), providing guidance to transcend ignorance."},
    {"id":33, "sanskrit_text": "श्रोत्रियोऽवृजिनोऽकामहतो यो ब्रह्मवित्तमः । \nब्रह्मण्युपरतः शान्तो निरिन्धन इवानलः \nअहेतुकदयासिन्धुर्बन्धुरानमतां सताम् ॥ ३३ ॥", "english_text": "śrotriyo’vṛjino’kāmahato yo brahmavittamaḥ | \nbrahmaṇyuparataḥ śānto nirindhana ivānalaḥ \nahetukadayāsindhurbandhurānamatāṃ satām || 33 ||", "meaning": "33. Who is versed in the Vedas, sinless, unsmitten by desire and a knower of Brahman par excellence, who has withdrawn himself into Brahman; calm, like fire that has consumed its fuel, who is a boundless reservoir of mercy that knows no reason, and a friend of all good people who prostrate themselves before him; –", "notes": "Fire…..fuel.—Cf. Svetasvatara, VI. 19. The state of mergence in Brahman, and t he perfe ct cessation of all activity of the relative plane is meant. The Sloka is an adaptation of the language of Srutis.", "explanation": "This verse, describes the ideal guru for a spiritual seeker: Śrotriyo’vṛjino’kāmahataḥ: He’s learned (śrotriya), morally impeccable (avṛjina), and untouched by selfish desires (akāmahata). Brahmavittamaḥ: He’s not just a knower but the 'best' knower of Brahman, implying realization, not just theoretical knowledge. Brahmaṇy uparataḥ śāntaḥ: He’s fully absorbed in Brahman, with all worldly activity ceased (uparata), radiating peace (śānta). Nirindhana ivānalaḥ: Like a fire that burns without fuel, he’s self-sustained, needing nothing external—symbolizing complete liberation.Ahetukadayāsindhur bandhur ānamatāṃ satām: His compassion is boundless and unconditional (ahetuka), and he’s a supportive friend to sincere seekers (satām) who approach with humility (ānamatāṃ)."},
    {"id":34, "sanskrit_text": "तमाराध्य गुरुं भक्त्या प्रह्वप्रश्रयसेवनैः । \nप्रसन्नं तमनुप्राप्य पृच्छेज्ज्ञातव्यमात्मनः ॥ ३४ ॥", "english_text": "tamārādhya guruṃ bhaktyā prahvapraśrayasevanaiḥ | \nprasannaṃ tamanuprāpya pṛcchejjñātavyamātmanaḥ || 34 ||", "meaning": "34. Worshipping that Guru with devotion, and approaching him, when he is pleased with prostration, humility and service, (he) should ask him what he has got to know:", "notes": "Serve the guru with devotion and respect, make him happy, and then ask him about the truth of your self", "explanation": "Him (tam) having worshipped (ārādhya) the guru (guruṃ) with devotion (bhaktyā) with humble, respectful service (prahvapraśrayasevanaiḥ), pleased (prasannaṃ) him (tam) having approached (anuprāpya), should ask (pṛcchet) that which is to be known (jñātavyam) of the self (ātmanaḥ)"},
    {"id":35, "sanskrit_text": "स्वामिन्नमस्ते नतलोकबन्धो \nकारुण्यसिन्धो पतितं भवाब्धौ । \nमामुद्धरात्मीयकटाक्षदृष्ट्या \nऋज्व्यातिकारुण्यसुधाभिवृष्ट्या ॥ ३५ ॥", "english_text": "svāminnamaste natalokabandho \nkāruṇyasindho patitaṃ bhavābdhau | \nmāmuddharātmīyakaṭākṣadṛṣṭyā \nṛjvyātikāruṇyasudhābhivṛṣṭyā || 35 ||", "meaning": "O Guru, friend of those who bow to you, ocean of mercy, I bow to you—save me from drowning in this sea of life and death with a simple look that pours out sweet, supreme kindness.", "notes": "The expression, abounding in hyperbole, is characteristically Oriental. The meaning is quite plain.", "explanation": "Svāmin namaste natalokabandho kāruṇyasindho: The disciple addresses the guru with reverence (namaste), as a master (svāmin), a friend to the surrendered (natalokabandho), and a boundless source of mercy (kāruṇyasindho). Patitaṃ bhavābdhau mām uddhara: The disciple sees themselves as 'fallen' (patitaṃ) into the turbulent 'ocean of samsara' (bhavābdhau) and begs for rescue (uddhara). Ātmīyakaṭākṣadṛṣṭyā ṛjvyātikāruṇyasudhābhivṛṣṭyā: The means of salvation is the guru’s compassionate glance (kaṭākṣadṛṣṭyā), described as simple (ṛjvyā) and overflowing with nectar-like kindness (atikāruṇyasudhābhivṛṣṭyā), symbolizing grace that uplifts effortlessly. It’s a poetic expression of surrender and trust in the guru’s power to liberate through mere compassion."},
    {"id":36, "sanskrit_text": "दुर्वारसंसारदवाग्नितप्तं \nदोधूयमानं दुरदृष्टवातैः । \nभीतं प्रपन्नं परिपाहि मृत्योः \nशरण्यमन्यद्यदहं न जाने ॥ ३६ ॥", "english_text": "durvārasaṃsāradavāgnitaptaṃ \ndodhūyamānaṃ duradṛṣṭavātaiḥ | \nbhītaṃ prapannaṃ paripāhi mṛtyoḥ \nśaraṇyamanyadyadahaṃ na jāne || 36 ||", "meaning": "36. Save me from death, afflicted as I am by the unquenchable fire of this world-forest, and shaken violently by the winds of an untoward lot, terrified and (so) seeking refuge in thee, for I do not know of any other man with whom to seek shelter.", "notes": "Forest-fire .—The world (Samsára) is commonly compared to a wilderness on fire. The physical and mental torments are referred to. Untoward lot— the aggregate of bad deeds done in one’s past incarnations, which bring on the evils of the present life.", "explanation": "This verse, is a desperate plea from the disciple to the guru: Durvārasaṃsāradavāgnitaptaṃ dodhūyamānaṃ duradṛṣṭavātaiḥ: The disciple vividly describes their plight—tormented by the relentless 'fire' of samsara (saṃsāra) and battered by 'winds' of fate (duradṛṣṭa), painting a picture of suffering and instability. Bhītaṃ prapannaṃ paripāhi mṛtyoḥ: Fearful (bhīta) and surrendered (prapanna), they beg for total protection (paripāhi) from death (mṛtyoḥ), symbolizing both physical death and the cycle of rebirth. Śaraṇyam anyat yad ahaṃ na jāne: The guru is their only hope (śaraṇyam), as they admit ignorance of any other savior."},
    {"id":37, "sanskrit_text": "शान्ता महान्तो निवसन्ति सन्तो \nवसन्तवल्लोकहितं चरन्तः । \nतीर्णाः स्वयं भीमभवार्णवं जनान् \nअहेतुनान् यानपि तारयन्तः ॥ ३७ ॥", "english_text": "śāntā mahānto nivasanti santo \nvasantavallokahitaṃ carantaḥ | \ntīrṇāḥ svayaṃ bhīmabhavārṇavaṃ janān \nahetunān yānapi tārayantaḥ || 37 ||", "meaning": "37. There are good souls, calm and magnanimous, who do good to others as does the spring, and who, having themselves crossed this dreadful ocean of birth and death, help others also to cross the same, without any motive whatsoever.", "notes": "Do good…… spring—i. e. unasked, out of their heart’s bounty, as the spring infuses new life into animate and inanimate nature, unobserved and unsought. The next Sloka follows up the idea.", "explanation": "This Verse, praises enlightened beings (possibly gurus or realized souls): Śāntā mahāntaḥ nivasanti santaḥ: These saints (santaḥ) are peaceful (śāntāḥ) and great (mahāntaḥ), living among us with a serene presence. Vasantavat lokahitaṃ carantaḥ: Like spring (vasantavat), which naturally benefits all, they act for humanity’s welfare (lokahitaṃ). Tīrṇāḥ svayaṃ bhīmabhavārṇavaṃ: They’ve crossed (tīrṇāḥ) the fearsome ocean of samsara (bhīmabhavārṇavaṃ) themselves, indicating liberation. Janān ahetunān yān api tārayantaḥ: Out of selfless compassion, they help others (janān) cross too, even those without merit or reason (ahetunān), showing unconditional grace."},
    {"id":38, "sanskrit_text": "अयं स्वभावः स्वत एव यत्पर \nश्रमापनोदप्रवणं महात्मनाम् । \nसुधांशुरेष स्वयमर्ककर्कश \nप्रभाभितप्तामवति क्षितिं किल ॥ ३८ ॥", "english_text": "ayaṃ svabhāvaḥ svata eva yatpara \nśramāpanodapravaṇaṃ mahātmanām | \nsudhāṃśureṣa svayamarkakarkaśa \nprabhābhitaptāmavati kṣitiṃ kila || 38 ||", "meaning": "This is the nature of great souls, that by itself it is inclined toward removing the suffering of others; like the moon naturally cools the earth burned by the harsh sun.", "notes": "It’s just how great souls are—they naturally want to ease others’ pain, like the moon by itself protects the earth scorched by the harsh sun’s radiance. ", "explanation": "This verse, uses a metaphor to describe enlightened beings:Ayaṃ svabhāvaḥ svata eva yat para śramāpanodapravaṇaṃ mahātmanām: The inherent nature (svabhāvaḥ) of great souls (mahātmanām) is to spontaneously (svataḥ eva) alleviate others’ suffering (śramāpanoda), without external prompting. Sudhāṃśur eṣaḥ svayam arkakarkaśa prabhābhitaptām avati kṣitiṃ kila: This is likened to the moon (sudhāṃśuḥ), which naturally (svayam) cools and protects (avati) the earth (kṣitiṃ) from the harsh sun’s (arkakarkaśa) scorching rays (prabhābhitaptām). The particle kila adds emphasis, as if marveling at this truth"},
    {"id":39, "sanskrit_text": "ब्रह्मानन्दरसानुभूतिकलितैः पूर्तैः सुशीतैर्युतैः \nयुष्मद्वाक्कलशोज्झितैः श्रुतिसुखैर्वाक्यामृतैः सेचय । \nसंतप्तं भवतापदावदहनज्वालाभिरेनं प्रभो \nधन्यास्ते भवदीक्षणक्षणगतेः पात्रीकृताः स्वीकृताः ॥ ३९ ॥", "english_text": "brahmānandarasānubhūtikalitaiḥ pūrtaiḥ suśītairyutaiḥ \nyuṣmadvākkalaśojjhitaiḥ śrutisukhairvākyāmṛtaiḥ secaya | \nsaṃtaptaṃ bhavatāpadāvadahanajvālābhirenaṃ prabho \ndhanyāste bhavadīkṣaṇakṣaṇagateḥ pātrīkṛtāḥ svīkṛtāḥ || 39 ||", "meaning": "Refresh me, afflicted by the flames of the burning forest fire of worldly suffering, O Lord, with the nectar-like words—imbued with the experienced bliss of Brahman, complete, soothingly cool, poured from the pitcher of your speech, and delightful to hear. Blessed are those accepted as worthy recipients of even a moment of your glance.", "notes": "O Lord, cool me down—I’m burning in the fire of life’s pain—with your sweet, blissful words that flow like nectar from your mouth, full of Brahman’s joy and soothing to hear. Lucky are those you look at even for a second and accept.", "explanation": "Brahmānandarasānubhūtikalitaiḥ… vākyāmṛtaiḥ secaya: The disciple begs for relief through the guru’s words (vākyāmṛtaiḥ), described as nectar-like (amṛta), full of Brahman’s bliss (brahmānanda), soothing (suśīta), and flowing from the guru’s speech (yuṣmadvākkalasha). Saṃtaptaṃ bhavatāpadāvadahanajvālābhiḥ enam prabho: The disciple is tormented (saṃtapta) by the 'flames' (jvālābhiḥ) of samsara’s suffering (bhavatāpa), pleading for rescue. Dhanyās te… svīkṛtāḥ: The verse ends with praise for those fortunate enough (dhanyāḥ) to receive the guru’s glance (īkṣaṇa), marking them as accepted (svīkṛtāḥ)."},
    {"id":40, "sanskrit_text": "कथं तरेयं भवसिन्धुमेतं \nका वा गतिर्मे कतमोऽस्त्युपायः । \nजाने न किञ्ज्चित्कृपयाव मां प्रभो \nसंसारदुःखक्षतिमातनुष्व ॥ ४0 ॥", "english_text": "kathaṃ tareyaṃ bhavasindhumetaṃ \nkā vā gatirme katamo’styupāyaḥ | \njāne na kiñjcitkṛpayāva māṃ prabho \nsaṃsāraduḥkhakṣatimātanuṣva || 40 ||", "meaning": "", "notes": "", "explanation": ""},
    {"id":41, "sanskrit_text": "", "english_text": "", "meaning": "", "notes": "", "explanation": ""},
    {"id":42, "sanskrit_text": "", "english_text": "", "meaning": "", "notes": "", "explanation": ""},
    {"id":43, "sanskrit_text": "", "english_text": "", "meaning": "", "notes": "", "explanation": ""},
    {"id":44, "sanskrit_text": "", "english_text": "", "meaning": "", "notes": "", "explanation": ""},
    {"id":45, "sanskrit_text": "", "english_text": "", "meaning": "", "notes": "", "explanation": ""},
    {"id":46, "sanskrit_text": "", "english_text": "", "meaning": "", "notes": "", "explanation": ""},
    {"id":47, "sanskrit_text": "", "english_text": "", "meaning": "", "notes": "", "explanation": ""},
    {"id":48, "sanskrit_text": "", "english_text": "", "meaning": "", "notes": "", "explanation": ""},



    const DATA_URL = 'https://raw.githubusercontent.com/madanpiske3/assets/refs/heads/main/data.json';

const MyComponent = () => {
    const [data, setData] = useState([]);
    const [loading, setLoading] = useState(true);

    // Function to fetch data from the URL
    const fetchData = async () => {
        setLoading(true);
        try {
            const response = await fetch(DATA_URL);
            const json = await response.json();
            setData(json);
            console.log(json);
        } catch (error) {
            console.error('Error fetching data:', error);
        } finally {
            setLoading(false);
        }
    };

    // Fetch data on initial render
    useEffect(() => {
        fetchData();
    }, []);
    

































]
